Repository: sameerxx67/finance-manager-fyp
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Yes
ar: نعم

source: No
ar: لا

source: Ok
ar: موافق

source: Dashboard
ar: لوحة التحكم

source: Transactions
ar: المعاملات

source: Report
ar: تقرير

source: Settings
ar: الإعدادات

source: Management
ar: الإدارة

source: Language
ar: اللغة

# theme_mode
source: Theme
ar: السمة

source: App Preferences
ar: تفضيلات التطبيق

# light_theme
source: Light
ar: فاتح

# dark_theme
source: Dark
ar: داكن

source: Follow device theme
ar: اتباع سمة الجهاز

source: App lock
ar: قفل التطبيق

# app_lock_description
source: Use your phone's PIN, pattern, or biometrics to unlock {app_name}
ar: استخدم رمز PIN أو النمط أو القياسات الحيوية لهاتفك لفتح {app_name}

source: Screenshot
ar: لقطة الشاشة

# enable_screenshot_description
source: Allow screenshots within the app interface.
ar: السماح بالتقاط لقطات الشاشة داخل واجهة التطبيق.

source: Security
ar: الأمان

# about_app
source: About {app_name}
ar: حول {app_name}

# share_app
source: Share {app_name}
ar: مشاركة {app_name}

# lock_app_localized_reason
source: Every time you open {app_name}, you will be asked to authenticate.
ar: سيُطلب منك المصادقة في كل مرة تفتح فيها {app_name}.

# unlock_app_localized_reason
source: Authentication will no longer be required to open {app_name}.
ar: لن تكون المصادقة مطلوبة لفتح {app_name}.

# enable_screenshot_localized_reason
source: Please verify to allow screenshot functionality
ar: يرجى التحقق للسماح بوظيفة لقطة الشاشة

# disable_screenshot_localized_reason
source: Confirm your identity to block screenshots
ar: قم بتأكيد هويتك لحظر لقطات الشاشة

# share_app_description
source: Take control of your finances with {app_name} — a smart, modern expense tracker that helps you manage your income, spending, and budgets all in one place. With a clean design, powerful insights, and support for multiple currencies and languages, it’s everything you need to build better financial habits. Download now and start tracking smarter: {url}
ar: تحكم في أموالك مع {app_name} - أداة تتبع النفقات الذكية والعصرية التي تساعدك في إدارة دخلك وإنفاقك وميزانياتك في مكان واحد. بتصميم أنيق ورؤى قوية ودعم متعدد العملات واللغات، فهو كل ما تحتاجه لبناء عادات مالية أفضل. حمل الآن وابدأ التتبع بذكاء: {url}

# version
source: Version {number}
ar: الإصدار {number}

# about_app_description_1
source: {app_name} is a modern expense tracking application designed to help you take full control of your personal finances. Whether you're managing daily spending, or analyzing financial trends, {app_name} offers a clean, intuitive interface with powerful tools to keep you organized.
ar: {app_name} هو تطبيق حديث لتتبع النفقات مصمم لمساعدتك في السيطرة الكاملة على أموالك الشخصية. سواء كنت تدير الإنفاق اليومي أو تحلل الاتجاهات المالية، يقدم {app_name} واجهة سهلة الاستخدام مع أدوات قوية لإبقائك منظمًا.

# about_app_description_2
source: With features like multi-currency support, biometric app lock, smart categories, income tracking, and real-time reports, {app_name} simplifies the way you manage money — all from your phone.
ar: بميزات مثل دعم العملات المتعددة، وقفل التطبيق البيومتري، والفئات الذكية، وتتبع الدخل، والتقارير الفورية، يبسط {app_name} طريقة إدارتك للمال - كل ذلك من هاتفك.

# about_app_description_3
source: Stay focused. Spend smarter. Live better.
ar: ابقَ مركزًا. أنفق بذكاء. عش بشكل أفضل.

source: Powered by
ar: مدعوم من

# currency_search
source: Start typing to search...
ar: ابدأ الكتابة للبحث...

# icon_search
source: Start typing to search...
ar: ابدأ الكتابة للبحث...

# app_locked_description
source: Access to the application is restricted. Please authenticate to continue.
ar: الوصول إلى التطبيق مقيد. يرجى المصادقة للمتابعة.

source: Unlock
ar: فتح

# app_locked
source: {app_name} locked
ar: {app_name} مقفل

source: Change Language
ar: تغيير اللغة

source: Change theme mode
ar: تغيير نمط السمة

# manage_categories
source: Categories
ar: الفئات

source: Add Category
ar: إضافة فئة

# add_category_description
source: Add a new expense or income category.
ar: أضف فئة جديدة للنفقات أو الدخل.

# manage_budgets
source: Budgets
ar: الميزانيات

# manage_budgets_description
source: Track spending with custom budgets.
ar: تتبع الإنفاق بميزانيات مخصصة.

# manage_tags
source: Tags
ar: العلامات

# manage_wallets
source: Wallets
ar: المحافظ

# manage_wallets_description
source: Track spending and balance across multiple wallets.
ar: تتبع الإنفاق والرصيد عبر محافظ متعددة.

source: Tags
ar: العلامات

source: Tag
ar: علامة

# error_failed_to_load
source: Failed to load {name}
ar: فشل تحميل {name}

# error_failed_to_add
source: Failed to add {name}
ar: فشل إضافة {name}

# error_failed_to_update
source: Failed to update {name}
ar: فشل تحديث {name}

# error_failed_to_delete
source: Failed to delete {name}
ar: فشل حذف {name}

source: Create {resource}
ar: إنشاء {resource}

source: Edit {resource}
ar: تعديل {resource}

source: Update {resource}
ar: تحديث {resource}

source: Delete {resource}
ar: حذف {resource}

source: Load {resource}
ar: تحميل {resource}

# resource_updated
source: {resource} has been updated successfully.
ar: تم تحديث {resource} بنجاح.

# resource_deleted
source: {resource} has been deleted successfully.
ar: تم حذف {resource} بنجاح.

# resource_created
source: {resource} has been created successfully.
ar: تم إنشاء {resource} بنجاح.

source: Create
ar: إنشاء

source: Update
ar: تحديث

source: Name
ar: الاسم

source: Color
ar: اللون

source: Enter {resource} name
ar: أدخل اسم {resource}

source: Done
ar: تم

source: Cancel
ar: إلغاء

source: Color Picker
ar: منتقي الألوان

# color_picker_description
source: Choose a {resource} color to organize visually.
ar: اختر لون {resource} لتنظيم مرئيًا.

source: {attribute} is required.
ar: {attribute} مطلوب.

source: This {attribute} is already used.
ar: هذا {attribute} مستخدم بالفعل.

source: {attribute} should be between {min} to {max} characters
ar: يجب أن يكون {attribute} بين {min} إلى {max} حرفًا

# tags_empty_screen_title
source: No Tags Yet
ar: لا توجد علامات بعد

# tags_empty_screen_description
source: Create your first tag to organize transactions.
ar: أنشئ علامتك الأولى لتنظيم المعاملات.

# confirm_delete_resource_message
source: Are you sure you want to delete the {resource} {name}? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف {resource} {name}؟ لا يمكن التراجع عن هذا الإجراء.

# categories_empty_screen_title
source: No Categories Yet
ar: لا توجد فئات بعد

# categories_empty_screen_description
source: Create your first category to organize transactions.
ar: أنشئ فئتك الأولى لتنظيم المعاملات.

source: Category
ar: فئة

source: Categories
ar: الفئات

source: Expenses
ar: النفقات

source: Income
ar: الدخل

source: Debts
ar: الديون

source: Type
ar: النوع

source: Icon
ar: الأيقونة

source: Icon Picker
ar: منتقي الأيقونات

# icon_picker_description
source: Pick an icon to represent the {resource}
ar: اختر أيقونة لتمثيل {resource}

source: Cash
ar: نقدي

source: Bank
ar: بنك

source: Credit Card
ar: بطاقة ائتمان

source: E-Wallet
ar: محفظة إلكترونية

source: Investment
ar: استثمار

source: Other
ar: أخرى

source: Wallet
ar: محفظة

source: Wallets
ar: المحافظ

# wallets_empty_screen_title
source: No Wallets Yet
ar: لا توجد محافظ بعد

# wallets_empty_screen_description
source: Create a wallet to start tracking your balances and transactions.
ar: أنشئ محفظة لبدء تتبع أرصدتك ومعاملاتك.

source: Balance
ar: الرصيد

source: Currency
ar: العملة

source: Default Currency
ar: العملة الافتراضية

source: {attribute} must be greater than {number}.
ar: يجب أن يكون {attribute} أكبر من {number}.

source: Current Balance
ar: الرصيد الحالي

source: End date must be after start date.
ar: يجب أن يكون تاريخ الانتهاء بعد تاريخ البدء.

source: Budget
ar: الميزانية

source: Budgets
ar: الميزانيات

# budgets_empty_screen_title
source: No Budgets Yet
ar: لا توجد ميزانيات بعد

# budgets_empty_screen_description
source: Start by creating a budget to manage your spending and track your goals.
ar: ابدأ بإنشاء ميزانية لإدارة إنفاقك وتتبع أهدافك.

source: Note
ar: ملاحظة

source: Start Date
ar: تاريخ البدء

source: End Date
ar: تاريخ الانتهاء

# budget_note_placeholder
source: Notes about this budget
ar: ملاحظات حول هذه الميزانية

source: Budget Range
ar: نطاق الميزانية

source: Select {resource}
ar: اختر {resource}

source: {attribute} must not exceed {number} characters.
ar: يجب ألا يتجاوز {attribute} {number} حرفًا.

source: Amount
ar: المبلغ

source: Budget limit
ar: حد الميزانية

source: spent of
ar: تم إنفاقه من

# wallet_displayed_balance_message
source: The wallet balance is displayed on the main screen.
ar: يتم عرض رصيد المحفظة على الشاشة الرئيسية.

# wallet_hidden_balance_message
source: Wallet balance is hidden on the main screen
ar: رصيد المحفظة مخفي على الشاشة الرئيسية

# wallet_blocked_balance_message
source: The wallet has been blocked from the app.
ar: تم حظر المحفظة من التطبيق.

# wallet_unblocked_balance_message
source: The wallet has been unblocked from the app.
ar: تم إلغاء حظر المحفظة من التطبيق.

source: Select Type
ar: اختر النوع

source: Main Category
ar: الفئة الرئيسية

# confirm_message_delete_without_sub_category
source: Are you sure you want to delete the {resource} "{name}"? All transactions related to this section will be removed, and the balances of the associated governorates will be restored to their previous state.
ar: هل أنت متأكد أنك تريد حذف {resource} "{name}"؟ سيتم إزالة جميع المعاملات المتعلقة بهذا القسم، وسيتم استعادة أرصدة المحافظ المرتبطة إلى حالتها السابقة.

# confirm_message_delete_has_sub_category
source: Are you sure you want to delete the {resource} "{name}"? All transactions related to this section and its sub-sections will be deleted, and the balances of the associated governorates will be restored to their previous state.
ar: هل أنت متأكد أنك تريد حذف {resource} "{name}"؟ سيتم حذف جميع المعاملات المتعلقة بهذا القسم وأقسامه الفرعية، وسيتم استعادة أرصدة المحافظ المرتبطة إلى حالتها السابقة.

source: Transaction
ar: معاملة

# transaction_empty_screen_title
source: No Transactions Yet
ar: لا توجد معاملات بعد

# transaction_empty_screen_description
source: Start by adding a new transaction to track your expenses, income, and debts.
ar: ابدأ بإضافة معاملة جديدة لتتبع نفقاتك ودخلك وديونك.

# confirm_delete_transaction_message
source: Are you sure you want to delete this transaction? This action will update the wallet balance to its previous state.
ar: هل أنت متأكد أنك تريد حذف هذه المعاملة؟ سيقوم هذا الإجراء بتحديث رصيد المحفظة إلى حالته السابقة.

# hint_text_transaction_amount
source: e.g {currency} 5.00
ar: مثال {currency} 5.00

# transaction_note_placeholder
source: Notes about this transaction
ar: ملاحظات حول هذه المعاملة

source: Transaction Date
ar: تاريخ المعاملة

source: Select category
ar: اختر فئة

source: Select wallet
ar: اختر محفظة

source: Select Time
ar: اختر الوقت

source: Select Date
ar: اختر التاريخ

source: No impact on balance
ar: لا يؤثر على الرصيد

# no_impact_on_balance_description
source: When enabled, this transaction will be excluded from the selected wallet's balance.
ar: عند التمكين، لن يتم تضمين هذه المعاملة في رصيد المحفظة المحددة.

source: Currency Rate
ar: سعر الصرف

source: Currency rates
ar: أسعار الصرف

# add_with_resource
source: Add {resource}
ar: إضافة {resource}

# currency_rates_with_default_currency
source: Currency Rates (Base: {defaultCurrency})
ar: أسعار الصرف (الأساس: {defaultCurrency})

# currency_rates_update_description
source: Manage and update exchange rates for different currencies based on your default currency.
ar: إدارة وتحديث أسعار الصرف للعملات المختلفة بناءً على عملتك الافتراضية.

# rate_title_input
source: Rate from ({defaultCurrency}) to ({currency})
ar: السعر من ({defaultCurrency}) إلى ({currency})

# hint_text_rate
source: e.g {currency} 0.70
ar: مثال {currency} 0.70

source: Stop automatic currency rate adjustment
ar: إيقاف التعديل التلقائي لسعر الصرف

source: Save
ar: حفظ

source: Total balance
ar: إجمالي الرصيد

# add_income_description
source: Record money you've received.
ar: تسجيل الأموال التي تلقتها.

# add_expenses_description
source: Log a new purchase or payment.
ar: تسجيل عملية شراء أو دفعة جديدة.

# add_debts_description
source: Track borrowed or owed money.
ar: تتبع الأموال المقترضة أو المستحقة.

source: View All
ar: عرض الكل

source: Recent Transactions
ar: آخر المعاملات

# dashboard_analytics_title
source: This Week's Income vs Expense
ar: الدخل مقابل النفقات هذا الأسبوع

# dashboard_analytics_subtitle
source: Daily breakdown of financial activity
ar: تفصيل يومي للنشاط المالي

# weekly_chart_empty_title
source: No Data to Display
ar: لا توجد بيانات لعرضها

# weekly_chart_empty_description
source: Add income or expense transactions to see your weekly chart.
ar: أضف معاملات دخل أو نفقات لرؤية الرسم البياني الأسبوعي.

source: Mon
ar: الإثنين

source: Tue
ar: الثلاثاء

source: Wed
ar: الأربعاء

source: Thu
ar: الخميس

source: Fri
ar: الجمعة

source: Sat
ar: السبت

source: Sun
ar: الأحد

source: Report Filter
ar: تصفية التقرير

source: Date Range
ar: نطاق التاريخ

source: Reset
ar: إعادة تعيين

source: Total Income
ar: إجمالي الدخل

source: Total Expenses
ar: إجمالي النفقات

source: Net Balance
ar: صافي الرصيد

source: Debts paid
ar: ديون مدفوعة

source: Debts received
ar: ديون مستلمة

source: Financial Summary
ar: ملخص مالي

source: Debts Summary
ar: ملخص الديون

source: No Data Available
ar: لا توجد بيانات متاحة

# report_categories_income_title
source: Top Income Sources
ar: أهم مصادر الدخل

# report_categories_income_subtitle
source: Your most frequent and valuable income streams.
ar: أكثر تدفقات الدخل تكرارًا وقيمة لديك.

# report_categories_expenses_title
source: Top Spending Areas
ar: أهم مجالات الإنفاق

# report_categories_expenses_subtitle
source: Categories where you spend the most money.
ar: الفئات التي تنفق فيها معظم أموالك.

# monthly_summary_title
source: Monthly Income vs Expenses
ar: الدخل الشهري مقابل النفقات

# monthly_summary_subtitle
source: Track income and expenses month by month.
ar: تتبع الدخل والنفقات شهرًا بشهر.

source: Add balance
ar: إضافة رصيد

source: Withdraw balance
ar: سحب رصيد

source: Withdraw
ar: سحب

source: Add
ar: إضافة

source: Failed to add balance
ar: فشل إضافة الرصيد

source: Failed to withdraw balance
ar: فشل سحب الرصيد

source: Balance added successfully!
ar: تمت إضافة الرصيد بنجاح!

source: Withdrawal successfully!
ar: تم السحب بنجاح!

source: Transactions Filter
ar: تصفية المعاملات

source: Search...
ar: بحث...

source: Top Tags
ar: أهم العلامات

# top_tags_subtitle
source: View top tags to track spending, income, and debt trends.
ar: عرض أهم العلامات لتتبع اتجاهات الإنفاق والدخل والديون.

source: Contacts
ar: جهات الاتصال

source: Contact
ar: جهة اتصال

# contacts_empty_screen_title
source: No Contacts Yet
ar: لا توجد جهات اتصال بعد

# contacts_empty_screen_description
source: Start by adding contacts to easily link transactions with people or businesses.
ar: ابدأ بإضافة جهات اتصال لربط المعاملات بالأشخاص أو الأعمال بسهولة.

# contact_phone_number_hint_text
source: Enter phone number
ar: أدخل رقم الهاتف

# contact_note_hint_text
source: Enter note
ar: أدخل ملاحظة

source: Transaction Details
ar: تفاصيل المعاملة

source: Show Details
ar: عرض التفاصيل

source: Error
ar: خطأ
